Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: A subject is a global data item whose value can be set either from the application or the UI, and whose value can be bound to widget properties.
it_it: Un soggetto è un elemento di dati globale il cui valore può essere impostato dall'applicazione o dall'interfaccia utente e può essere associato alle proprietà del widget.

source: A subset of Flexbox and Grid layouts is supported.
it_it: È supportato un sottoinsieme di layout Flexbox e Grid.

source: A symbol (typically an arrow) can be added to the Drop-Down List with :cpp:expr:`lv_dropdown_set_symbol(dropdown, LV_SYMBOL_...)`
it_it: Un simbolo (in genere una freccia) può essere aggiunto alla Drop-Down List con :cpp:expr:`lv_dropdown_set_symbol(dropdown, LV_SYMBOL_...)`

source: A symbol is a specific Unicode character in a font with an icon-like image.
it_it: Un simbolo è un carattere Unicode specifico in un font con un'immagine simile a un'icona.

source: A tab can be renamed with :cpp:expr:`lv_tabview_set_tab_text(tabview, tab_id, "New Name")`.
it_it: Un tab può essere rinominato con :cpp:expr:`lv_tabview_set_tab_text(tabview, tab_id, "New Name")`.

source: A target font engine needs to be selected and named in order to be referenced in XML files later.
it_it: È necessario selezionare e denominare un motore di font di destinazione per potervi fare riferimento in seguito nei file XML.

source: A third-party library could be used to add content to a texture and the driver will draw the texture in the window.
it_it: È possibile utilizzare una libreria di terze parti per aggiungere contenuto a una texture e il driver disegnerà la texture nella finestra.

source: A typical use case is the light/dark theme switching.
it_it: Un tipico caso d'uso è il passaggio da tema chiaro a tema scuro.

source: A typical use case is to call these functions in the ``VALUE_CHANGED`` event of the Arc.
it_it: Un tipico caso d'uso è chiamare queste funzioni nell'evento ``VALUE_CHANGED`` dell'Arco.

source: A typical use case looks like this:
it_it: Un tipico caso d'uso si presenta così:

source: A useful BitBake option to consider is the ``-k`` or ``--continue`` option.
it_it: Un'opzione BitBake utile da considerare è ``-k`` o ``--continue``.

source: A user can navigate between the tiles by swiping.
it_it: Un utente può navigare tra i tile scorrendo.

source: A user's inactivity time is measured and stored with each ``lv_display_t`` object.
it_it: Il tempo di inattività di un utente viene misurato e memorizzato con ciascun oggetto ``lv_display_t``.

source: A value of 255, `LV_OPA_100` or `LV_OPA_COVER` means fully opaque.
it_it: Un valore di 255, `LV_OPA_100` o `LV_OPA_COVER` significa completamente opaco.

source: A variety of standard interfaces, such as POSIX, CMSIS, C++ application environment.
it_it: Una varietà di interfacce standard, come POSIX, CMSIS, ambiente applicativo C++.

source: A very simple *hello world* label
it_it: Un'etichetta *hello world* molto semplice

source: A widget can also subscribe to a subject.
it_it: Anche un widget può sottoscrivere un soggetto.

source: A widget can be in a combination of the following states:
it_it: Un widget può trovarsi in una combinazione dei seguenti stati:

source: A widget's "box" includes:
it_it: Il "box" di un widget include:

source: A widget's value is different from the expected value after emulating user inputs.
it_it: Il valore di un widget è diverso dal valore previsto dopo l'emulazione degli input dell'utente.

source: AC6 is not free, but it offers a community license that can be activated as follows:
it_it: AC6 non è gratuita, ma offre una licenza community che può essere attivata come segue:

source: API pseudo-directive or end-of-file, whichever comes first.
it_it: API o con la fine del file, a seconda di quale si verifica per prima.

source: API pseudo-directives below:
it_it: API seguenti:

source: API Conventions
it_it: Convenzioni API

source: ARGB8888 + optional opacity.
it_it: ARGB8888 + opacità opzionale.

source: ARGB8888 with RGB pre-darkened according to alpha channel value
it_it: ARGB8888 con RGB pre-oscurato in base al valore del canale alfa

source: Abbreviations:
it_it: Abbreviazioni:

source: About
it_it: Informazioni

source: About Toradex
it_it: Informazioni su Toradex

source: Accepted Licenses and Copyright Notices
it_it: Licenze Accettate e Note di Copyright

source: Accepted characters
it_it: Caratteri accettati

source: Access nodes by index, numeric path or path:
it_it: Accedere ai nodi tramite indice, percorso numerico o path:

source: Access to a DRM device node, typically ``/dev/dri/card0``.
it_it: Accesso a un device node DRM, in genere ``/dev/dri/card0``.

source: Accessing the Parts
it_it: Accesso alle Parti

source: Accessing the parts
it_it: Accesso alle parti

source: Achieve 30% faster render times and 30% reduced CPU usage on the new ESP32-P4 with native hardware acceleration.
it_it: Si ottengono tempi di rendering più rapidi del 30% e un utilizzo della CPU ridotto del 30% sul nuovo ESP32-P4 con accelerazione hardware nativa.

source: Action
it_it: Azione

source: Activate Auto-Completion
it_it: Attiva il Completamento Automatico

source: Activate the driver by setting :c:macro:`LV_USE_NXP_ELCDIF` to ``1`` in your *"lv_conf.h"*.
it_it: Attivare il driver impostando :c:macro:`LV_USE_NXP_ELCDIF` a ``1`` nel file *"lv_conf.h"*.

source: Activate the driver by setting :c:macro:`LV_USE_RENESAS_GLCDC` to ``1`` in your ``lv_conf.h``.
it_it: Attivare il driver impostando :c:macro:`LV_USE_RENESAS_GLCDC` a ``1`` nel file ``lv_conf.h``.

source: Active
it_it: Attivo

source: Active Screen
it_it: Lo Screen Attivo

source: Add Animation templates to the Timeline by calling :cpp:expr:`lv_anim_timeline_add(timeline, start_time, &anim_template)`.
it_it: Aggiungere template di Animazione alla Timeline chiamando :cpp:expr:`lv_anim_timeline_add(timeline, start_time, &anim_template)`.

source: Add G2D related source files (and corresponding headers if available) to project:
it_it: Aggiungere i file sorgente relativi a G2D (e i relativi header, se disponibili) al progetto:

source: Add LVGL to an ESP32 IDF project
it_it: Aggiungere LVGL a un progetto ESP32 IDF

source: Add LVGL to your Project
it_it: Aggiungere LVGL al Progetto

source: Add PXP related source files (and corresponding headers if available) to project:
it_it: Aggiungere i file sorgente relativi a PXP (e i relativi header, se disponibili) al progetto:

source: Add Translations
it_it: Aggiungere Traduzioni

source: Add VGLite related source files (and corresponding headers if available) to project:
it_it: Aggiungere i file sorgente correlati a VGLite (e gli header corrispondenti, se disponibili) al progetto:

source: Add `FontAwesome.woff <https://lvgl.io/assets/others/FontAwesome5-Solid+Brands+Regular.woff>`__.
it_it: Aggiungere `FontAwesome.woff <https://lvgl.io/assets/others/FontAwesome5-Solid+Brands+Regular.woff>`__.

source: Add ``Arm-2D/Library/Include`` to the include paths.
it_it: Aggiungere ``Arm-2D/Library/Include`` ai path degli "include".

source: Add ``_var`` to ``lv_global_t`` on ``lv_global.h``
it_it: Aggiungere ``_var`` a ``lv_global_t`` su ``lv_global.h``

source: Add ``vt.global_cursor_default=0``.
it_it: Aggiungere ``vt.global_cursor_default=0``.

source: Add a commit message at the bottom of the page.
it_it: Aggiungere un messaggio di commit in fondo alla pagina.

source: Add a display using ``lv_wayland_window_create()``, possibly with a close callback to track the status of each display:
it_it: Aggiungere un display utilizzando ``lv_wayland_window_create()``, possibilmente con una callback di chiusura per tracciare lo stato di ciascun display:

source: Add a link target (anchor) before heading or paragraph that will be linked to:
it_it: Aggiungere un link di destinazione (àncora) prima dell'intestazione o del paragrafo a cui verrà collegato:

source: Add a subdirectory in the project's root ``CMakeLists.txt`` to include the UI in the compilation stage:
it_it: Aggiungere una sottodirectory nella directory principale del progetto ``CMakeLists.txt`` per includere l'interfaccia utente nella fase di compilazione:

source: Add a tile
it_it: Aggiungere un tile

source: Add an entry under "Libraries (-l)" that is "nemagfx-float-abi-hard".
it_it: Aggiungere una voce in "Libraries (-l)" che sia "nemagfx-float-abi-hard".

source: Add an entry under "Library search path (-L)" which is a path to "libs/nema_gfx/lib/core/cortex_m33_revC/gcc" e.g. "${workspace_loc:/${ProjName}/Middlewares/LVGL/lvgl/libs/nema_gfx/lib/core/cortex_m33_revC/gcc}".
it_it: Aggiungere una voce in "Library search path (-L)" che sia un path per "libs/nema_gfx/lib/core/cortex_m33_revC/gcc" ad esempio "${workspace_loc:/${ProjName}/Middlewares/LVGL/lvgl/libs/nema_gfx/lib/core/cortex_m33_revC/gcc}".

source: Add at least 2 spaces after Doxygen commands for improved readability.
it_it: Aggiungere almeno 2 spazi dopo i comandi Doxygen per una migliore leggibilità.

source: Add each needed Span to a Spangroup like this:
it_it: Ogni Span necessario a uno Spangroup si aggiunge in questo modo:

source: Add include path: ``/usr/include/freetype2`` (for GCC: ``-I/usr/include/freetype2 -L/usr/local/lib``)
it_it: Aggiungere il path degli include: ``/usr/include/freetype2`` (per GCC: ``-I/usr/include/freetype2 -L/usr/local/lib``)

source: Add it to ./docs/src/include/external_links.txt if not already there.
it_it: Aggiungerlo a ./docs/src/include/external_links.txt se non è già presente.

source: Add style properties as is documented in :ref:`style_initialize`.
it_it: Aggiungere le proprietà di stile come documentato in :ref:`style_initialize`.

source: Add styles to parts and states
it_it: Aggiunta di stili a parti e a stati

source: Add the UI elements of each channel to its group
it_it: Aggiungere gli elementi dell'interfaccia utente di ogni canale al suo gruppo

source: Add the Unicode ID of the symbol to the range field.
it_it: Aggiungere l'ID Unicode del simbolo al campo "range".

source: Add the following flag to it: ``-DLV_LVGL_H_INCLUDE_SIMPLE``
it_it: Aggiungere il seguente flag: ``-DLV_LVGL_H_INCLUDE_SIMPLE``

source: Add the input devices.
it_it: Aggiungere i dispositivi di input.

source: Add the layers with the Bitbake command like this
it_it: Si aggiungono i layer col comando Bitbake in questo modo:

source: Add your changes to the file.
it_it: Aggiungere le modifiche al file.

source: Add your changes.
it_it: Aggiungere le modifiche.

source: Added to the default group
it_it: Aggiunti al gruppo di default

source: Adding libjpeg-turbo to Your Project
it_it: Aggiungere libjpeg-turbo al Progetto

source: Adding Custom Code
it_it: Aggiunta di Codice Personalizzato

source: Adding Events to a Widget
it_it: Aggiunta di Eventi a un Widget

source: Adding FFmpeg to Your Project
it_it: Aggiungere FFmpeg al Progetto

source: Adding FreeType to Your Project
it_it: Aggiungere FreeType al Progetto

source: Adding Generic Code
it_it: Aggiunta di Codice Generico

source: Adding Images to Your Project
it_it: Aggiungere Immagini al Progetto

source: Adding Measurement Points
it_it: Aggiunta di Punti di Misurazione

source: Adding New Layouts
it_it: Aggiungere Nuovi Layout

source: Adding Styles to Widgets
it_it: Aggiungere Stili ai Widget

source: Adding a Custom Symbol
it_it: Aggiunta di un Simbolo Custom

source: Adding a Driver
it_it: Aggiunta di un Driver

source: Adding a New Font
it_it: Aggiungere un Nuovo Font

source: Adding a New Font Engine
it_it: Aggiungere un Nuovo Motore di Font

source: Adding an image to LVGL via the `LVGL Online Image Converter`_ is easy:
it_it: Aggiungere un'immagine a LVGL tramite `LVGL Online Image Converter`_ è semplice:

source: Adding and/or Removing Multiple Flags
it_it: Aggiunta e/o Rimozione di Più Flag

source: Adding buttons
it_it: Aggiunta di pulsanti

source: Adding libpng to Your Project
it_it: Aggiungere libpng al Progetto

source: Adding libwebp to Your Project
it_it: Aggiungere libwebp al progetto

source: Adding padding makes the indicator smaller or larger.
it_it: L'aggiunta di un padding rende l'indicatore più piccolo o più grande.

source: Adding styles to the widgets
it_it: Aggiungere stili ai widget

source: Adding tabs
it_it: Aggiunta di schede

source: Adding text
it_it: Aggiunta di testo

source: Additional BSPs and examples are available in the `esp-bsp <https://github.com/espressif/esp-bsp>`__ repository.
it_it: Ulteriori BSP ed esempi sono disponibili nel repository `esp-bsp <https://github.com/espressif/esp-bsp>`__.

source: Additional Changes to Make Use of SPIRAM
it_it: Ulteriori Modifiche per l'Utilizzo di SPIRAM

source: Additional Notes
it_it: Note Aggiuntive

source: Additional Rlottie Considerations in ESP-IDF
it_it: Ulteriori considerazioni su Rlottie in ESP-IDF

source: Additional space between characters.
it_it: Spazio aggiuntivo tra i caratteri.

source: Additional space between lines.
it_it: Spazio aggiuntivo tra le righe.

source: Additionally, Button Matrix is an editable Widget: it allows selecting and clicking the buttons with encoder and keyboard navigation as well.
it_it: Inoltre, Button Matrix è un Widget modificabile: consente di selezionare e cliccare sui pulsanti anche con encoder e navigazione da tastiera.

source: Additionally, a tolerance of :cpp:expr:`lv_dpx(50)` pixels is applied to each angle, extending the hit-test range along the Arc's length.
it_it: Inoltre, a ciascun angolo viene applicata una tolleranza di :cpp:expr:`lv_dpx(50)` pixel, estendendo l'intervallo di hit-test per tutta la lunghezza dell'Arco.

source: Additionally, if you want full keyboard support, including letters and modifiers, you'll need the development version of libxkbcommon installed (usually ``libxkbcommon-dev``).
it_it: Inoltre, per il supporto completo della tastiera, incluse lettere e modificatori, è necessario installare la versione di sviluppo di libxkbcommon (solitamente ``libxkbcommon-dev``).

source: Additionally, if your device crashes and you have a core dump, you can use GDB to analyze the core dump.
it_it: Inoltre, se il dispositivo si blocca e si verifica un core dump, è possibile utilizzare GDB per analizzarlo.

source: Additionally, image-drawing-related functions can be used for layers.
it_it: Inoltre, per i layer possono essere utilizzate funzioni relative al disegno delle immagini.

source: Additionally, it is necessary to enable display and input drivers:
it_it: Inoltre, è necessario abilitare i driver di visualizzazione e input:

source: Additionally, the screen rotation can be handled by the PXP:
it_it: Inoltre, la rotazione dello schermo può essere gestita da PXP:

source: Additionally, while you might be able to pass initialization of the ``lv_rlottie_t`` object, as rlottie renders frame to frame, this consumes additional memory.
it_it: Inoltre, sebbene sia possibile passare l'inizializzazione dell'oggetto ``lv_rlottie_t``, poiché rlottie renderizza frame per frame, questo consuma memoria aggiuntiva.

source: Additionally, you can activate a force refresh mode with ``lv_linux_fbdev_set_force_refresh(true)``.
it_it: Inoltre, si può attivare una modalità di aggiornamento forzato con ``lv_linux_fbdev_set_force_refresh(true)``.

source: Addtionally the user can make the current LVGL settings permanent, or default, for the current project, all that is needed is to create a file on the project root called `sdkconfig.defaults` and move the `CONFIG_LV_` symbols to that file.
it_it: Inoltre, l'utente può rendere permanenti, o di default, le impostazioni LVGL attuali per il progetto corrente. Tutto ciò che serve è creare un file nella root del progetto chiamato `sdkconfig.defaults` e spostare i simboli `CONFIG_LV_` in quel file.

source: Adjust sensitivity for rotary encoders in 1/256 unit.
it_it: Regola la sensibilità per i codificatori rotativi in unità 1/256.

source: Adjust the ``^9.*`` part to match your LVGL version requirement.
it_it: Modificare la parte ``^9.*`` in base ai requisiti di versione LVGL.

source: Adjust the center offset of the arc using :cpp:expr:`lv_arclabel_set_center_offset_x(arclabel, x)` and :cpp:expr:`lv_arclabel_set_center_offset_y(arclabel, y)`.
it_it: Regolare l'offset del centro dell'arco usando :cpp:expr:`lv_arclabel_set_center_offset_x(arclabel, x)` e :cpp:expr:`lv_arclabel_set_center_offset_y(arclabel, y)`.

source: Adjust vertical text alignment with :cpp:expr:`lv_arclabel_set_text_vertical_align(arclabel, LV_ARCLABEL_TEXT_ALIGN_CENTER)`.
it_it: Regolare l'allineamento verticale del testo con :cpp:expr:`lv_arclabel_set_text_vertical_align(arclabel, LV_ARCLABEL_TEXT_ALIGN_CENTER)`.

source: Advanced Materials
it_it: Materiali Avanzati

source: Advanced Usage
it_it: Utilizzo Avanzato

source: Advanced configuration:
it_it: Configurazione avanzata:

source: Advanced graphics with animations, anti-aliasing, opacity, smooth scrolling
it_it: Grafica avanzata con animazioni, anti-aliasing, opacità, scorrimento fluido

source: Advanced topics
it_it: Argomenti avanzati

source: Advancing the tick value should be done in such a way that its timing is reliable and not dependent on anything that consumes an unknown amount of time.
it_it: L'avanzamento del valore di tick dovrebbe essere eseguito in modo tale che la sua temporizzazione sia affidabile e non dipenda da nulla che consumi una quantità di tempo sconosciuta.

source: Advantages
it_it: Vantaggi

source: Advantages of using styles:
it_it: Vantaggi dell'utilizzo degli stili:

source: After 65% fully blue.
it_it: Dopo il 65% completamente blu.

source: After a Span is created, use the following functions to set its text and style properties:
it_it: Dopo aver creato uno Span, si usano le seguenti funzioni per impostarne le proprietà di testo e stile:

source: After a chart is created, it initially contains no cursors.
it_it: Dopo la creazione di un grafico, inizialmente non contiene cursori.

source: After a chart is created, it initially contains no data series.
it_it: Dopo la creazione, un grafico inizialmente non contiene alcuna serie di dati.

source: After a font is created, you can change the font size in pixels by using :cpp:expr:`lv_tiny_ttf_set_size(font, font_size)`.
it_it: Dopo aver creato un font, è possibile modificarne la dimensione in pixel utilizzando :cpp:expr:`lv_tiny_ttf_set_size(font, font_size)`.

source: After any of a bar code's settings have changed, call :cpp:func:`lv_barcode_update` again to regenerate it.
it_it: Dopo aver modificato una qualsiasi delle impostazioni di un codice a barre, richiamare nuovamente :cpp:func:`lv_barcode_update` per rigenerarlo.

source: After calling ``idf.py build flash`` the picture should be displayed on the screen.
it_it: Dopo aver chiamato ``idf.py build flash``, l'immagine dovrebbe essere visualizzata sullo schermo.

source: After calling this function, LVGL will be running in the background; that is, unlike the usual approach, there is no need to periodically call :cpp:expr:`lv_timer_handler()`, this function is called by a background task managed by the IDF.
it_it: Dopo aver chiamato questa funzione, LVGL verrà eseguito in background; ovvero, a differenza dell'approccio consueto, non è necessario chiamare periodicamente :cpp:expr:`lv_timer_handler()`, questa funzione viene chiamata da un task in background gestito dall'IDF.

source: After compilation, the resulting executable is written to ``lv_port_linux/bin/lvglsim``.
it_it: Dopo la compilazione, l'eseguibile risultante viene scritto in ``lv_port_linux/bin/lvglsim``.

source: After copying `lv_conf_template.h` to `lv_conf.h` make the following changes to the latter:
it_it: Dopo aver copiato `lv_conf_template.h` in `lv_conf.h` si apportano le seguenti modifiche a quest'ultimo:

source: After enabling the log module and setting :c:macro:`LV_LOG_LEVEL` accordingly, LVGL will send log messages to the ``Serial`` port (default 115200 bps).
it_it: Dopo aver abilitato il modulo log e impostato :c:macro:`LV_LOG_LEVEL` di conseguenza, LVGL invierà messaggi di log alla porta ``Seriale`` (per default a 115200 bps).

source: After enabling the log module and setting :c:macro:`LV_LOG_LEVEL` accordingly, the output log is sent to the ``Serial`` port @ 115200 bps.
it_it: Dopo aver abilitato il modulo di log e impostato :c:macro:`LV_LOG_LEVEL` di conseguenza, il log di output viene inviato alla porta ``Seriale`` @ 115200 bps.

source: After initialization, each field of the draw descriptor can be set.
it_it: Dopo l'inizializzazione, è possibile impostare ogni campo del descrittore di disegno.

source: After initializing a style, properties can be added or changed.
it_it: Dopo aver inizializzato uno stile, è possibile aggiungere o modificare proprietà.

source: After initializing the stops with :cpp:expr:`lv_grad_init_stops` call either :cpp:expr:`lv_grad_horizontal_init(&grad_dsc)` or :cpp:expr:`lv_grad_vertical_init(&grad_dsc)` to get a horizontal or vertical gradient descriptor.
it_it: Dopo aver inizializzato gli stop con :cpp:expr:`lv_grad_init_stops` si chiama :cpp:expr:`lv_grad_horizontal_init(&grad_dsc)` o :cpp:expr:`lv_grad_vertical_init(&grad_dsc)` per ottenere un descrittore di gradiente orizzontale o verticale.

source: After initializing the stops with :cpp:func:`lv_grad_init_stops` call :cpp:expr:`lv_grad_linear_init(&grad_dsc, from_x, from_y, to_x, to_y, LV_GRAD_EXTEND_...)` with your point values and extend pattern strategy to get a linear gradient descriptor.
it_it: Dopo aver inizializzato gli stop con :cpp:func:`lv_grad_init_stops` si chiama :cpp:expr:`lv_grad_linear_init(&grad_dsc, from_x, from_y, to_x, to_y, LV_GRAD_EXTEND_...)` con i valori dei punti e si estende la strategia del pattern per ottenere un descrittore di gradiente lineare.

source: After initializing the stops with :cpp:func:`lv_grad_init_stops`, the conic gradient can be set up with: :cpp:expr:`lv_grad_conical_init(&grad, center_x, center_y, angle_start, angle_end, LV_GRAD_EXTEND_...)`
it_it: Dopo aver inizializzato gli stop con :cpp:func:`lv_grad_init_stops`, il gradiente conico può essere impostato con: :cpp:expr:`lv_grad_conical_init(&grad, center_x, center_y, angle_start, angle_end, LV_GRAD_EXTEND_...)`

source: After initializing the stops with :cpp:func:`lv_grad_init_stops`, the outer circle can be set by: :cpp:expr:`lv_grad_radial_init(&grad_dsc, center_x, center_y, edge_x, edge_y, LV_GRAD_EXTEND_...)`
it_it: Dopo aver inizializzato gli stop con :cpp:func:`lv_grad_init_stops`, il cerchio esterno può essere impostato con: :cpp:expr:`lv_grad_radial_init(&grad_dsc, center_x, center_y, edge_x, edge_y, LV_GRAD_EXTEND_...)`

source: After installing LVGL, copy ``lv_conf_template.h`` from the LVGL repo into your project and rename it to ``lv_conf.h`` Place it in your ``include/`` or ``src/`` folder, and enable/disable LVGL features by editing the macros.
it_it: Dopo aver installato LVGL, copiare ``lv_conf_template.h`` dal repository LVGL nel proprio progetto e rinominalo in ``lv_conf.h``. Inserirlo nella cartella ``include/`` o ``src/`` e abilitare/disabilitare le funzionalità LVGL modificando le macro.

source: After leaving the screen, it remains in memory, so all states are preserved.
it_it: Dopo aver abbandonato la schermata, questa rimane in memoria, quindi tutti gli stati vengono preservati.

source: After logging in you need select a licence for the list.
it_it: Dopo aver effettuato l'accesso, è necessario selezionare una licenza dall'elenco.

source: After preparing the files, they should be moved to the target device:
it_it: Dopo aver preparato i file, è necessario spostarli sul dispositivo di destinazione:

source: After registration, a Widget can be created like this from C code:
it_it: Dopo la registrazione, un Widget può essere creato in questo modo partendo da codice C:
